struts1/struts1.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>struts1整合hibernate3</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-11-30 06:11:25 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>
<div id="content">

<h1 class="title">struts1整合hibernate3</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 struts1优点 </a>
<ul>
<li><a href="#sec-1.1">1.1 解决的问题 </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 Model2的缺点 </a></li>
<li><a href="#sec-1.1.2">1.1.2 实现 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 struts流程 </a>
<ul>
<li><a href="#sec-2.1">2.1 初始化流程 </a></li>
<li><a href="#sec-2.2">2.2 基本工作流程 </a></li>
</ul>
</li>
<li><a href="#sec-3">3 struts1整合spring3例子 </a>
<ul>
<li><a href="#sec-3.1">3.1 建立工程 </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 创建新web project </a></li>
<li><a href="#sec-3.1.2">3.1.2 加载struts </a></li>
<li><a href="#sec-3.1.3">3.1.3 项目配置修正 </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 完善工程 </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 添加画面 </a></li>
<li><a href="#sec-3.2.2">3.2.2 修改struts-config.xml </a></li>
<li><a href="#sec-3.2.3">3.2.3 添加formbean和actionbean </a></li>
<li><a href="#sec-3.2.4">3.2.4 添加menu画面 </a></li>
</ul>
</li>
<li><a href="#sec-3.3">3.3 调试工程 </a></li>
<li><a href="#sec-3.4">3.4 tomcat配置mysql数据库连接池 </a>
<ul>
<li><a href="#sec-3.4.1">3.4.1 配置server.xml </a></li>
<li><a href="#sec-3.4.2">3.4.2 配置web.xml </a></li>
<li><a href="#sec-3.4.3">3.4.3 访问数据库 </a></li>
<li><a href="#sec-3.4.4">3.4.4 jsp页面 </a></li>
</ul>
</li>
<li><a href="#sec-3.5">3.5 tomcat配置Hibernate3应用 </a>
<ul>
<li><a href="#sec-3.5.1">3.5.1 建立数据库连接池 </a></li>
<li><a href="#sec-3.5.2">3.5.2 使用Hibernate进行数据连接 </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> struts1优点 </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> 解决的问题 </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Model2的缺点 </h4>
<div class="outline-text-4" id="text-1.1.1">

<ul>
<li id="sec-1.1.1.1">必须为每个用户请求写一个控制器 <br/>
</li>
<li id="sec-1.1.1.2">业务庞大时会有很多的控制器 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> 实现 </h4>
<div class="outline-text-4" id="text-1.1.2">

<ul>
<li id="sec-1.1.2.1">所有的请求都到一个中央控制器(ActionServlet)统一处理 <br/>
</li>
<li id="sec-1.1.2.2">有利维护工作,增强了系统扩展性 <br/>
</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> struts流程 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> 初始化流程 </h3>
<div class="outline-text-3" id="text-2.1">

<ul>
<li id="sec-2.1.1">加载ActionServlet(取决于Servlet容器) <br/>
<ul>
<li id="sec-2.1.1.1">根据配置文件的&lt;load-on-startup&gt;标签决定是容器启动时加载还是第一次请求来到时加载 <br/>
</li>
</ul>
</li>
<li id="sec-2.1.2">加载并初始化struts的配置文件struts-config.xml <br/>
<ul>
<li id="sec-2.1.2.1">把每个&lt;action&gt;标签的内容生成ActionMapping对象存放在内存中 <br/>
</li>
<li id="sec-2.1.2.2">将每个&lt;form-bean&gt;标签都生成ActionFormBean对象放在内存中 <br/>
</li>
<li id="sec-2.1.2.3">加载并初始化消息文件到内存中 <br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> 基本工作流程 </h3>
<div class="outline-text-3" id="text-2.2">

<ul>
<li id="sec-2.2.1">请求到来时,在内存中找与之匹配的ActionMapping对象 <br/>
<ul>
<li id="sec-2.2.1.1">找到后进入下一步骤 <br/>
</li>
<li id="sec-2.2.1.2">找不到抛出错误信息 <br/>
</li>
</ul>
</li>
<li id="sec-2.2.2">找到ActionMapping对象对应的formBean,并创建实例,将请求的信息填充到对象中 <br/>
</li>
<li id="sec-2.2.3">根据配置的validate属性决定是否进行表单验证 <br/>
<ul>
<li id="sec-2.2.3.1">如果需要就执行formBean的validate方法 <br/>
<ul>
<li id="sec-2.2.3.1.1">如果返回null或不包含ActionMessage对象的ActionErrors对象,则表示验证通过 <br/>
</li>
<li id="sec-2.2.3.1.2">如果不通过则根据struts.xml中配置的input标签属性跳转到相应的错误页面 <br/>
</li>
</ul>
</li>
</ul>
</li>
<li id="sec-2.2.4">通过验证后配置映射对象并创建该Action对象,执行execute()完成业务逻辑操作,返回ActionForward对象 <br/>
</li>
<li id="sec-2.2.5">ActionServlet根据返回的ActionForward对象,生成动态页面并响应客户端 <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> struts1整合spring3例子 </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> 建立工程 </h3>
<div class="outline-text-3" id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1"><span class="section-number-4">3.1.1</span> 创建新web project </h4>
<div class="outline-text-4" id="text-3.1.1">

</div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2"><span class="section-number-4">3.1.2</span> 加载struts </h4>
<div class="outline-text-4" id="text-3.1.2">

</div>

</div>

<div id="outline-container-3.1.3" class="outline-4">
<h4 id="sec-3.1.3"><span class="section-number-4">3.1.3</span> 项目配置修正 </h4>
<div class="outline-text-4" id="text-3.1.3">

<ul>
<li id="sec-3.1.3.1">web.xml <br/>
<ul>
<li id="sec-3.1.3.1.1">&lt;web-app&gt;属性全部删除 <br/>
</li>
<li id="sec-3.1.3.1.2">添加本工程的标签定义库 <br/>
<ul>
<li>
&lt;taglib&gt;
&lt;taglib-uri&gt;tld文件路径名称&lt;/taglib-uri&gt;
&lt;taglib-location&gt;同上&lt;/taglib-location&gt;
&lt;/taglib&gt;
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> 完善工程 </h3>
<div class="outline-text-3" id="text-3.2">


</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1"><span class="section-number-4">3.2.1</span> 添加画面 </h4>
<div class="outline-text-4" id="text-3.2.1">

<ul>
<li id="sec-3.2.1.1">index <br/>
<ul>
<li id="sec-3.2.1.1.1">添加指令&lt;%@ taglib uri="" prefix=""%&gt; <br/>
</li>
<li id="sec-3.2.1.1.2">资源信息 &lt;bean:message key=""/&gt; <br/>
</li>
<li id="sec-3.2.1.1.3">链接 &lt;html:link page=""/&gt; <br/>
</li>
</ul>
</li>
<li id="sec-3.2.1.2">login <br/>
<ul>
<li id="sec-3.2.1.2.1">&lt;html:form action="/action名称" method="post" focus="userName"&gt; <br/>
</li>
<li id="sec-3.2.1.2.2">&lt;html:text property=""/&gt; <br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.2" class="outline-4">
<h4 id="sec-3.2.2"><span class="section-number-4">3.2.2</span> 修改struts-config.xml </h4>
<div class="outline-text-4" id="text-3.2.2">

<ul>
<li id="sec-3.2.2.1">&lt;form-beans&gt; <br/>
&lt;form-beans&gt;
&lt;form-bean name="" type=""/&gt;
&lt;/form-beans&gt;
</li>
<li id="sec-3.2.2.2">action-mapping中配置action <br/>
&lt;action path="" type="" name="" scope=""&gt;
&lt;forward name="" path=""/&gt;
&lt;/action&gt;
</li>
<li id="sec-3.2.2.3">资源文件 <br/>
&lt;message-resources parmeter="资源文件名称"&gt;
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.3" class="outline-4">
<h4 id="sec-3.2.3"><span class="section-number-4">3.2.3</span> 添加formbean和actionbean </h4>
<div class="outline-text-4" id="text-3.2.3">

<ul>
<li id="sec-3.2.3.1">继承ActionForm <br/>
</li>
<li id="sec-3.2.3.2">继承Action <br/>
<ul>
<li id="sec-3.2.3.2.1">重写execute方法 <br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.4" class="outline-4">
<h4 id="sec-3.2.4"><span class="section-number-4">3.2.4</span> 添加menu画面 </h4>
<div class="outline-text-4" id="text-3.2.4">

</div>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> 调试工程 </h3>
<div class="outline-text-3" id="text-3.3">

</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4"><span class="section-number-3">3.4</span> tomcat配置mysql数据库连接池 </h3>
<div class="outline-text-3" id="text-3.4">


</div>

<div id="outline-container-3.4.1" class="outline-4">
<h4 id="sec-3.4.1"><span class="section-number-4">3.4.1</span> 配置server.xml </h4>
<div class="outline-text-4" id="text-3.4.1">




<pre class="src src-xml">&lt;<span style="color: #7fffd4; font-weight: bold;">Context</span> <span style="color: #7fffd4; font-weight: bold;">path</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">docBase</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span>&gt;
 &lt;<span style="color: #7fffd4; font-weight: bold;">Resource</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">auth</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">type</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span>/&gt;
 &lt;<span style="color: #7fffd4; font-weight: bold;">ResourceParams</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span>&gt;
   &lt;<span style="color: #7fffd4; font-weight: bold;">parameter</span>&gt;&lt;<span style="color: #7fffd4; font-weight: bold;">name</span>=""/&gt;&lt;/<span style="color: #7fffd4; font-weight: bold;">parameter</span>&gt;
 &lt;/<span style="color: #7fffd4; font-weight: bold;">ResourceParams</span>&gt;
&lt;/<span style="color: #7fffd4; font-weight: bold;">Context</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-3.4.2" class="outline-4">
<h4 id="sec-3.4.2"><span class="section-number-4">3.4.2</span> 配置web.xml </h4>
<div class="outline-text-4" id="text-3.4.2">




<pre class="src src-xml">&lt;<span style="color: #7fffd4; font-weight: bold;">Resource-ref</span>&gt;
  &lt;<span style="color: #7fffd4; font-weight: bold;">res-ref-name</span>&gt;&#19978;&#38754;&#23450;&#20041;&#30340;&#25968;&#25454;&#28304;&lt;/<span style="color: #7fffd4; font-weight: bold;">res-ref-name</span>&gt;
&lt;/<span style="color: #7fffd4; font-weight: bold;">Resource-ref</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-3.4.3" class="outline-4">
<h4 id="sec-3.4.3"><span class="section-number-4">3.4.3</span> 访问数据库 </h4>
<div class="outline-text-4" id="text-3.4.3">




<pre class="src src-java"><span style="color: #9acd32; font-weight: bold;">Context</span> <span style="color: #7fffd4; font-weight: bold;">ctx</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">InitialContext</span>()
DataSource ds = (<span style="color: #9acd32; font-weight: bold;">DataSource</span>)ctx.lookup(<span style="color: #ffa07a;">"&#25968;&#25454;&#24211;&#36335;&#24452;"</span>)
Connection conn = ds.getConnection();
<span style="color: #9acd32; font-weight: bold;">Statement</span> <span style="color: #7fffd4; font-weight: bold;">stmt</span> = conn.createStatementZ();
<span style="color: #9acd32; font-weight: bold;">ResultSet</span> <span style="color: #7fffd4; font-weight: bold;">rs</span> = stmt.executeQuery();
conn.close();
</pre>


</div>

</div>

<div id="outline-container-3.4.4" class="outline-4">
<h4 id="sec-3.4.4"><span class="section-number-4">3.4.4</span> jsp页面 </h4>
<div class="outline-text-4" id="text-3.4.4">

<ul>
<li id="sec-3.4.4.1">数据源的名字java:comp/env/jdbc/数据源名称 <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5"><span class="section-number-3">3.5</span> tomcat配置Hibernate3应用 </h3>
<div class="outline-text-3" id="text-3.5">


</div>

<div id="outline-container-3.5.1" class="outline-4">
<h4 id="sec-3.5.1"><span class="section-number-4">3.5.1</span> 建立数据库连接池 </h4>
<div class="outline-text-4" id="text-3.5.1">

<ul>
<li id="sec-3.5.1.1">添加Hibernate3应用支持 <br/>
<ul>
<li>
hibernate.cfg.xml文件一定要放在根目录 src下
</li>
<li>
通过Hibernate3 Configuration来配置数据库
<ul>
<li>
DataSource
</li>
<li>
Dialect
</li>
<li>
show<sub>sql</sub> 
</li>
</ul>
</li>
</ul>
</li>
<li id="sec-3.5.1.2">创建SessionFactory <br/>



<pre class="src src-java"><span style="color: #add8e6;">// </span><span style="color: #add8e6;">&#21333;&#20363;&#27169;&#24335;&#21019;&#24314; SessionFactory&#21644;Session
</span> <span style="color: #fa8072;">public</span> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">HibernateUtil</span>
{
  <span style="color: #fa8072;">private</span> <span style="color: #fa8072;">static</span> <span style="color: #fa8072;">final</span> <span style="color: #9acd32; font-weight: bold;">SessionFactory</span> <span style="color: #7fffd4; font-weight: bold;">sessionFactory</span>;
  <span style="color: #fa8072;">static</span>{
    <span style="color: #fa8072;">try</span>{
     sessionFactory = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Configuration</span>().configure().buildSessionFactory();
    }<span style="color: #fa8072;">catch</span>(<span style="color: #9acd32; font-weight: bold;">Throwable</span> <span style="color: #7fffd4; font-weight: bold;">ex</span>)
  {
    <span style="color: #fa8072;">throw</span> <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">ExceptionInitializerError</span>(<span style="color: #ffa07a;">"ex"</span>);
  }
  }
  <span style="color: #fa8072;">public</span> <span style="color: #fa8072;">static</span> <span style="color: #fa8072;">final</span> <span style="color: #9acd32; font-weight: bold;">ThreadLocal</span> <span style="color: #7fffd4; font-weight: bold;">session</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">ThreadLocal</span>();
  <span style="color: #fa8072;">public</span> <span style="color: #fa8072;">static</span> <span style="color: #9acd32; font-weight: bold;">Session</span> <span style="color: #7fffd4; font-weight: bold;">currentSession</span>()
  {
    <span style="color: #9acd32; font-weight: bold;">Session</span> <span style="color: #7fffd4; font-weight: bold;">s</span> = (<span style="color: #9acd32; font-weight: bold;">Session</span>)session.get();
    <span style="color: #fa8072;">if</span>(s==<span style="color: #7fffd4;">null</span>)
   {
     s = sessionFactory.openSession();
    session.set(s);
   }
   <span style="color: #fa8072;">return</span> s;
  }

 <span style="color: #fa8072;">public</span> <span style="color: #fa8072;">static</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">closeSession</span>()
 {
  <span style="color: #9acd32; font-weight: bold;">Session</span> <span style="color: #7fffd4; font-weight: bold;">s</span> = (<span style="color: #9acd32; font-weight: bold;">Session</span>)session.get();
  <span style="color: #fa8072;">if</span>(s!==<span style="color: #7fffd4;">null</span>)
  {
    s.close();
  }
  session.set(<span style="color: #7fffd4;">null</span>);
 }
}
</pre>


</li>
<li id="sec-3.5.1.3">编辑数据库连接驱动 <br/>
</li>
<li id="sec-3.5.1.4">创建Hibernate Mapping <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.5.2" class="outline-4">
<h4 id="sec-3.5.2"><span class="section-number-4">3.5.2</span> 使用Hibernate进行数据连接 </h4>
<div class="outline-text-4" id="text-3.5.2">

<ul>
<li id="sec-3.5.2.1">session获取 <br/>
<ul>
<li>
org.hibernate.Session s = HibernateUtil.currentSession();
</li>
</ul>
</li>
<li id="sec-3.5.2.2">查询的实现 <br/>
<ul>
<li>
org.hibernate.Query query = s.createQuery();
</li>
<li>
获取查询对象
<ul>
<li>
对象类名 对象名 = (对象类名)query.List().get(0);
</li>
</ul>
</li>
</ul>
</li>
<li id="sec-3.5.2.3">关闭session <br/>
<ul>
<li>
HibernateUtil.closeSession();
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: 
</p>
<p class="date"> Date: 2010-11-30 06:11:25 </p>
<p class="creator">HTML generated by org-mode 6.35i in emacs 24</p>
</div>
</div>
</body>
</html>
